tap "dnote/dnote"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "yt-dlp/taps"
# Run your GitHub Actions locally 🚀
brew "act"
# Automatic configure script builder
brew "autoconf"
# Core application library for C
brew "glib"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tool for service discovery, monitoring and configuration
brew "consul"
# Distributed search & analytics engine
brew "elasticsearch@6"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang"
# Key value store for shared configuration and service discovery
brew "etcd"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Validating, recursive, caching DNS resolver
brew "unbound", restart_service: true
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Analytics and search dashboard for Elasticsearch
brew "kibana"
# Postgres C API library
brew "libpq"
# Java-based project management
brew "maven"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Open source distributed and RESTful search engine
brew "opensearch"
# Open source visualization dashboards for OpenSearch
brew "opensearch-dashboards"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Messaging broker
brew "rabbitmq"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# DNS privacy enabled stub resolver service based on getdns
brew "stubby"
# Simplified and community-driven man pages
brew "tldr"
# Anonymizing overlay network for TCP
brew "tor"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Centralized server for distributed coordination of services
brew "zookeeper"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple command-line notebook for programmers
brew "dnote/dnote/dnote"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@4.2"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# A youtube-dl fork with additional features and fixes
brew "yt-dlp/taps/yt-dlp"
# Web browser focusing on privacy
cask "brave-browser"
# Free and open-source web browser
cask "chromium"
# Managed desktop virtualization solution
cask "citrix-workspace"
# Server and cloud storage browser
cask "cyberduck"
# Matrix collaboration client
cask "element"
# Desktop client for GitHub repositories
cask "github"
# Decentralised instant messenger and softphone
cask "jami"
# Web browser
cask "librewolf"
# File system integration
cask "macfuse"
# App to write, plan, collaborate, and get organized
cask "notion"
# Web browser
cask "opera"
# Collaboration platform for API development
cask "postman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# News reader with flexible settings
cask "raven-reader"
# Team communication and collaboration software
cask "slack"
# Real time file synchronization software
cask "syncthing"
# Web browser focusing on security
cask "tor-browser"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
