tap "dnote/dnote"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Run your GitHub Actions locally 🚀
brew "act"
# Automatic configure script builder
brew "autoconf"
# Core application library for C
brew "glib"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Programming language for highly scalable real-time systems
brew "erlang"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Validating, recursive, caching DNS resolver
brew "unbound", restart_service: true
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Postgres C API library
brew "libpq"
# Java-based project management
brew "maven"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node", link: false
# Manage multiple Node.js versions
brew "nvm"
# General-purpose scripting language
brew "php", link: false
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Messaging broker
brew "rabbitmq", restart_service: true
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Rust toolchain installer
brew "rustup-init"
# Implementation of Java Servlet and JavaServer Pages
brew "tomcat", restart_service: true
# Anonymizing overlay network for TCP
brew "tor", restart_service: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple command-line notebook for programmers
brew "dnote/dnote/dnote"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
cask "background-music"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Free and open-source web browser
cask "chromium"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Free and open-source painting and sketching program
cask "krita"
# Office suite
cask "libreoffice"
# Text editor
cask "macvim"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# GUI for streamlined Redis application development
cask "redisinsight"
# Music streaming service
cask "spotify"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
