tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "heroku/brew"

brew "autoconf"
cask "iterm2"
cask "firefox"
brew "git"
brew "erlang"
brew "freetds"
brew "gh"
brew "git-lfs"
brew "glib"
brew "gradle"
brew "grep"
brew "httpie"
brew "maven"
brew "act"
brew "nmap"
brew "nvm"
brew "rabbitmq", restart_service: true
brew "redis", restart_service: true
brew "tomcat"
brew "tor"
brew "tree"
brew "vim", link: false
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
cask "chromium"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community"
brew "mongodb/brew/mongodb-database-tools"
cask "android-file-transfer"
cask "boop"
cask "background-music"
cask "balenaetcher"
cask "cyberduck"
cask "flash-player"
cask "google-chrome"
cask "gpg-suite"
cask "intellij-idea"
cask "krita"
cask "macvim"
cask "mongodb-compass"
cask "mysqlworkbench"
cask "pgadmin4"
cask "postman"
cask "qbittorrent"
cask "rectangle"
cask "rstudio"
cask "spotify"
cask "telegram-desktop"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
brew "docker-compose"
